06-strings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>06-strings</title>
<!-- 2021-01-08 Fri 10:45 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">06-strings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Strings</a>
<ul>
<li><a href="#sec-1-1">1.1. Index</a></li>
<li><a href="#sec-1-2">1.2. Length</a></li>
<li><a href="#sec-1-3">1.3. Methods</a></li>
<li><a href="#sec-1-4">1.4. Further reading</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Strings</h2>
<div class="outline-text-2" id="text-1">
<p>
Strings are values that have special properties other types of values don't have.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Index</h3>
<div class="outline-text-3" id="text-1-1">
<p>
One such property allows us to access specific letters in a string. We call the position of a letter the <b>index</b>. For example, the string 'Alice' has the letter 'A' at index 0. Yes, 0. We can say that 'A' is the first letter of the string, so it is at the first position. But <b>indices</b> start at 0. In other words, the index of a letter is one less than its position.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name[0]); // A
console.log(name[3]); // c
console.log(name[4]); // e
</pre>
</div>

<p>
Of course, we can use variables to hold index numbers, since variables are just placeholders for values.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
const i = 0;
console.log(name[i]); // A
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Length</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Another useful property of strings is that we can get their length very easily.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name.length); // 5
</pre>
</div>

<p>
The syntax looks a bit odd because <b>length</b> is not a function; it's a property that exists in all strings that we create. The moment we create a string, its length is calculated and stored hidden inside of it. Using <code>someString.length</code> lets us access that precalculated number.
</p>

<p>
One of the most common uses of the length property is to get the last letter of a string without having to guess at its index. The last letter is at the index one less than the length of the string.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name[name.length - 1]); // e
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Methods</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Methods are functions that act like a property of a value. Like the length property, and unlike regular functions, methods go after the string. Instead of taking the operating string as an argument, it's like an implicit (hidden) argument.
</p>

<p>
One such method is <code>includes()</code>. As its name suggests, we can check if a string includes another string.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
const frozenWater = 'ice';
console.log(name.includes('ice')); // true
console.log(name.includes(frozenWater)); // true
console.log(name.includes('A')); // true
console.log(name.includes('Ace')); // false
console.log(name.includes('a')); // false
</pre>
</div>

<p>
Another useful method is <code>startsWith()</code>. We can check if a string starts with another string.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name.startsWith('A')); // true
console.log(name.startsWith('Ali')); // true
console.log(name.startsWith('Alice')); // true
console.log(name.startsWith('ice')); // false
</pre>
</div>

<p>
Of course, there is also <code>endsWith()</code>.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name.endsWith('e')); // true
console.log(name.endsWith('ice')); // true
console.log(name.endsWith('Alice')); // true
console.log(name.endsWith('A')); // false
</pre>
</div>

<p>
There are many more useful methods to play with.
</p>

<div class="org-src-container">

<pre class="src src-js">const name = 'Alice';
console.log(name.toUpperCase()); // ALICE
console.log(name.toLowerCase()); // alice
console.log(name.indexOf('i')); // 2
console.log(name.repeat(3)); // AliceAliceAlice
console.log(name.replace('ice', 'ejandro')); // Alejandro
console.log(name.slice(2)); // ice
console.log(name.slice(1, 4)); // lic
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Further reading</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Read more about strings on MDN:
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-01-08 Fri 10:45</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
